Repository: abdellaheltrach/SchoolProject
Catalog: School.Core/Resources/SharedResources.*.resx
Languages: ar

source: Address
ar: العنوان

# BadRequest
source: The request could not be processed due to invalid input.
ar: تعذر معالجة الطلب بسبب بيانات غير صحيحة.

# CreateSuccess
source: The resource has been created successfully.
ar: تم إنشاء المورد بنجاح

# DatabaseUpdateError
source: An error occurred while saving data. Please try again.
ar: حدث خطأ أثناء حفظ البيانات. يرجى المحاولة مرة أخرى.

# DeleteSuccess
source: Deleted Successfully
ar: تم الحذف بنجاح

# DepartementID
source: Departenent
ar: القسم

# InternalServerError
source: An unexpected error occurred. Please contact support if the problem persists.
ar: حدث خطأ غير متوقع. يرجى التواصل مع الدعم إذا استمرت المشكلة.

# NameAr
source: Arabic Name
ar: الاسم بالعربية

# NameEn
source: English name
ar: الاسم بالإنجليزية

# PropNotExist
source: The specified {PropertyName} does not exist.
ar: {PropertyName} المحدد غير موجود.

# NotFound
source: The requested resource was not found.
ar: المورد المطلوب غير موجود.

source: Phone
ar: الهاتف

# StudentID
source: Student
ar: معرف الطالب

# Success
source: Action executed successfully
ar: تم تنفيذ العملية بنجاح

# UnAuthorized
source: You are not Authorized To Access This Resources
ar: لا تملك الصلاحية للوصول لتلك المصادر

# UnprocessableEntity
source: The request is valid, but one or more fields contain invalid data.
ar: الطلب صالح، ولكن يوجد خطأ في واحد أو أكثر من الحقول المدخلة.

# ValidationFailed
source: One or more validation errors occurred.
ar: حدثت أخطاء في التحقق من صحة البيانات.

# PropRequired
source: {PropertyName} is required.
ar: الحقل {PropertyName} مطلوب.

# PropNotEmpty
source: {PropertyName} must not be empty.
ar: الحقل {PropertyName} لا يجب أن يكون فارغًا.

# PropMaxLengthis100
source: {PropertyName} must not exceed 100 characters.
ar: يجب ألا يتجاوز طول حقل {PropertyName} 100 حرفًا.

# PasswordNotEqualConfirmationPassword
source: Password and confirmation password do not match.
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقين.

# InvalidEmail
source: email address is not valid.
ar: يجب أن يكون البريدًا الإلكترونيً صالحًا.

# PropAlreadyExists
source: {PropertyName} already exists.
ar: {PropertyName} موجود مسبقًا.

# PasswordTooWeak
source: Password is too weak. It must contain at least 8 characters, including uppercase, lowercase, number, and special character.
ar: كلمة المرور ضعيفة جدًا. يجب أن تحتوي على 8 أحرف على الأقل، بما في ذلك حرف كبير، حرف صغير، رقم، ورمز خاص.

# UserCreationFailed
source: Failed to create the user. Please try again later.
ar: فشل إنشاء المستخدم. يرجى المحاولة مرة أخرى لاحقًا.

# UserNameIsExist
source: Username already exists.
ar: اسم المستخدم موجود مسبقًا.

# UpdateUserFailed
source: Failed to update the user. Please try again later.
ar: فشل تحديث بيانات المستخدم. يرجى المحاولة مرة أخرى لاحقًا.

# UserUpdated
source: User updated successfully.
ar: تم تحديث بيانات المستخدم بنجاح.

# PropMustBeGreaterThanZero
source: {PropertyName} must be greater than zero.
ar: يجب أن تكون قيمة {PropertyName} أكبر من صفر.

# DeletedFailed
source: Failed to delete the record. Please try again later.
ar: فشل حذف السجل. يرجى المحاولة مرة أخرى لاحقًا.

# Deleted
source: Record deleted successfully.
ar: تم حذف السجل بنجاح.

source: Invalid credentials.
ar: بيانات الدخول غير صحيحة.

# TokenStillValid
source: The access token is still valid.
ar: رمز الوصول لا يزال صالحًا.

# InvalidAccessToken
source: The access token is invalid or expired.
ar: رمز الوصول غير صالح أو منتهي الصلاحية.

# InvalidRefreshToken
source: The refresh token is invalid or has expired.
ar: رمز التحديث غير صالح أو منتهي الصلاحية.

# Forbidden
source: You do not have permission to access this resource.
ar: الوصول محظور.

# CreateFailed
source: Creation failed. Please try again.
ar: فشلت عملية الإنشاء.

# RoleIsUsed
source: The role is currently in use and cannot be deleted.
ar: الدور مستخدم حاليًا.

# RoleNotExist
source: The role does not exist.
ar: الدور غير موجود.

# UserNotFound
source: The user was not found.
ar: المستخدم غير موجود.

# FailedToRemoveOldRoles
source: Failed to remove the old roles.
ar: فشل في إزالة الأدوار القديمة.

# FailedToAddNewRoles
source: Failed to add the new roles.
ar: فشل في إضافة الأدوار الجديدة.

source: Failed to update user roles.
ar: فشل في تحديث أدوار المستخدم.

# FailedToRemoveOldClaims
source: Failed to remove the old claims.
ar: فشل في إزالة الصلاحيات القديمة.

# FailedToAddNewClaims
source: Failed to add the new claims.
ar: فشل في إضافة الصلاحيات الجديدة.

source: Failed to update claims.
ar: فشل في تحديث الصلاحيات.

# SendEmailFailed
source: Failed to send the email.
ar: فشل في إرسال البريد الإلكتروني.

# EmailNotConfirmed
source: Email is not confirmed.
ar: البريد الإلكتروني غير مؤكد.

# EmailIsExist
source: Email already exists.
ar: البريد الإلكتروني موجود بالفعل.

# ConfirmEmailDone
source: Email confirmed successfully.
ar: تم تأكيد البريد الإلكتروني بنجاح.

# ErrorWhenConfirmEmail
source: An error occurred while confirming the email.
ar: حدث خطأ أثناء تأكيد البريد الإلكتروني.

# InvaildCode
source: Invalid code.
ar: رمز غير صالح.
